; domain
(define (domain liftedtcore_blocksworld-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :action-costs)
 (:types block)
 (:constants
   black_block_1 brown_block_1 - block
 )
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block) (hold_0) (hold_1))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (when (and (not (and (clear brown_block_1) (not (= ?obj brown_block_1)))) (not (and (clear black_block_1) (not (= ?obj black_block_1))))) (hold_0)) (when (or (not (and (ontable brown_block_1) (not (= ?obj brown_block_1)))) (= ?obj brown_block_1) (holding brown_block_1)) (hold_1)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (when (and (not (or (= ?obj brown_block_1) (clear brown_block_1))) (not (or (= ?obj black_block_1) (clear black_block_1)))) (hold_0)) (when (or (not (or (= ?obj brown_block_1) (ontable brown_block_1))) (and (holding brown_block_1) (not (= ?obj brown_block_1)))) (hold_1)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (when (and (not (or (= ?obj brown_block_1) (and (clear brown_block_1) (not (= ?underobj brown_block_1))))) (not (or (= ?obj black_block_1) (and (clear black_block_1) (not (= ?underobj black_block_1)))))) (hold_0)) (when (or (not (ontable brown_block_1)) (and (holding brown_block_1) (not (= ?obj brown_block_1)))) (hold_1)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (when (and (not (or (= ?underobj brown_block_1) (and (clear brown_block_1) (not (= ?obj brown_block_1))))) (not (or (= ?underobj black_block_1) (and (clear black_block_1) (not (= ?obj black_block_1)))))) (hold_0)) (when (or (not (ontable brown_block_1)) (= ?obj brown_block_1) (holding brown_block_1)) (hold_1)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_blocksworld-problem)
 (:domain liftedtcore_blocksworld-domain)
 (:objects
   yellow_block_1 brown_block_2 purple_block_1 - block
 )
 (:init (ontable yellow_block_1) (ontable brown_block_1) (on brown_block_2 yellow_block_1) (on purple_block_1 brown_block_2) (ontable black_block_1) (clear brown_block_1) (clear purple_block_1) (clear black_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (on yellow_block_1 brown_block_2) (hold_0) (hold_1)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack purple_block_1 brown_block_2)
   deleted: (on purple_block_1 brown_block_2) (clear purple_block_1) (handempty)
   added: (holding purple_block_1) (clear brown_block_2)
   goals met: 0 of 3
2. (stack purple_block_1 black_block_1)
   deleted: (clear black_block_1) (holding purple_block_1)
   added: (handempty) (clear purple_block_1) (on purple_block_1 black_block_1)
   goals met: 0 of 3
3. (unstack brown_block_2 yellow_block_1)
   deleted: (on brown_block_2 yellow_block_1) (clear brown_block_2) (handempty)
   added: (holding brown_block_2) (clear yellow_block_1)
   goals met: 0 of 3
4. (putdown brown_block_2)
   deleted: (holding brown_block_2)
   added: (clear brown_block_2) (handempty) (ontable brown_block_2)
   goals met: 0 of 3
5. (pickup yellow_block_1)
   deleted: (clear yellow_block_1) (ontable yellow_block_1) (handempty)
   added: (holding yellow_block_1)
   goals met: 0 of 3
6. (stack yellow_block_1 brown_block_2)
   deleted: (clear brown_block_2) (holding yellow_block_1)
   added: (handempty) (clear yellow_block_1) (on yellow_block_1 brown_block_2)
   goals met: 1 of 3
7. (pickup brown_block_1)
   deleted: (clear brown_block_1) (ontable brown_block_1) (handempty)
   added: (holding brown_block_1) (hold_0) (hold_1)
   goals met: 3 of 3
